import Bread from '../assets/bread.png';
import Persil from '../assets/persil.png';
import Garbage from '../assets/garbage.png';
import Fairy from '../assets/fairy.png';
import Oil from '../assets/oil.png';
import Robot from '../assets/robot.png';
import Praska from '../assets/praska.png';
import Bilyzna from '../assets/bilyzna.png';
import Shvabra from '../assets/shvabra.png';
import Power from '../assets/power.png';

export const Gifts = [
    {
        name: 'Хліб',
        description: 'Хліб – універсальний і практичний ' +
            'подарунок. Він може стати основою для ' +
            'багатьох страв і закусок, його легко ' +
            'зберігати та транспортувати. Завдяки ' +
            'можливості готувати бутерброди, ' +
            'використовувати як основу для піци або ' +
            'навіть підсмажувати на сніданок, хліб є універсальною їжею, яку можна адаптувати до будь-якої страви чи смаку. Крім того, багато молодих чоловіків, які живуть самі, можуть не мати доступу до домашньої кухні та можуть покладатися на фаст-фуд або напівфабрикати, тому, подарувавши їм свіжий буханець хліба, можна спонукати їх зробити вибір здоровішої їжі.',
        photo: Bread,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D1%85%D0%BB%D1%96%D0%B1'
    },
    {
        name: 'Пральний порошок',
        description: 'Подарунок миючого засобу може здатися не найцікавішим подарунком, але він може бути неймовірно корисним. Коли пральний порошок закінчується в самий невідповідний момент, це може викликати сильний стрес і незручності. Якщо подарувати комусь резервний запас мийного засобу, це означає, що ви думаєте про його практичні потреби та хочете полегшити його життя. Цей маленький, але продуманий подарунок може оцінити будь-хто, особливо ті, хто живе сам і не має розкоші ділити домашні справи з партнером.',
        photo: Persil,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D0%BF%D1%80%D0%B0%D0%BB%D1%8C%D0%BD%D0%B8%D0%B9+%D0%BF%D0%BE%D1%80%D0%BE%D1%88%D0%BE%D0%BA'
    },
    {
        name: 'Сміттєві пакети',
        description: 'Закінчення пакетів для сміття в незручний момент може стати справжнім головним болем. Цей практичний подарунок продемонструє вашу турботу про повсякденні потреби одержувача та полегшить йому життя. Продемонструйте свою дбайливість з цим незамінним предметом побуту.',
        photo: Garbage,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D1%81%D0%BC%D1%96%D1%82%D1%82%D1%94%D0%B2%D1%96+%D0%BF%D0%B0%D0%BA%D0%B5%D1%82%D0%B8'
    },
    {
        name: 'Засіб для миття посуду',
        sub: '*да, якшо деколи мити посуд - то фейрі може закінчитись',
        description: 'Засіб для миття посуду корисний тим, що мити посуд стає легше та ефективніше. Рідина, що розмивається, допомагає видаляти бруд і частинки їжі, а інгредієнти рідини допомагають розщепити жир і масло, полегшуючи їх змивання.',
        photo: Fairy,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D0%B7%D0%B0%D1%81%D1%96%D0%B1+%D0%B4%D0%BB%D1%8F+%D0%BC%D0%B8%D1%82%D1%82%D1%8F+%D0%BF%D0%BE%D1%81%D1%83%D0%B4%D1%83'
    },
    {
        name: 'Олія',
        sub: 'p.s. тоже був в шоці коли поняв шо олія реально може колись закінчитись',
        description: 'Олія - корисний і практичний подарунок для будь-якої кухні. Він необхідний для приготування їжі та може покращити смак страв. Високоякісна олія також може мати користь для здоров’я, що робить її продуманим і цінним подарунком. ',
        photo: Oil,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D0%BE%D0%BB%D1%96%D1%8E+%D0%A0%D0%90%D0%A4%D0%86%D0%9D%D0%9E%D0%92%D0%90%D0%9D%D0%A3'
    },
    {
        name: 'Робот-пилосос',
        description: 'Робот-пилосос — це розумний і ефективний пристрій, який може зробити прибирання безпроблемним завданням. Це чудовий подарунок для чоловіка, який живе сам, оскільки він усуває потребу в ручному прибиранні та економить час і енергію. Завдяки розширеним функціям, таким як планування, навігація та керування додатками, він пропонує зручне та ретельне очищення.',
        photo: Robot,
        isExpensive: true,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D1%80%D0%BE%D0%B1%D0%BE%D1%82+%D0%BF%D0%B8%D0%BB%D0%BE%D1%81%D0%BE%D1%81'
    },
    {
        name: 'Відпарювач стаціонарний',
        description: 'Відпарювач для одягу — це прилад, який використовується для видалення складок з одягу без необхідності прасування. Він використовує гарячу пару, щоб розгладити волокна тканини, і одяг виглядає щойно випрасуваним. Це зручна та ефективна альтернатива традиційному прасуванню, що робить його чудовим подарунком для тих, хто цінує охайний і презентабельний зовнішній вигляд.',
        photo: Praska,
        isExpensive: true,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D0%B2%D1%96%D0%B4%D0%BF%D0%B0%D1%80%D1%8E%D0%B2%D0%B0%D1%87+%D1%81%D1%82%D0%B0%D1%86%D1%96%D0%BE%D0%BD%D0%B0%D1%80%D0%BD%D0%B8%D0%B9'
    },
    {
        name: 'Постільна білизна',
        description: 'Набір постільної білизни, наприклад, простирадла та наволочки, може стати зручним і практичним подарунком для тих, хто живе один. М’яка та затишна постільна білизна може покращити якість сну, а наявність свіжого комплекту постільної білизни може зробити кімнату оновленою та свіжою.',
        link: 'https://www.google.com/search?q=%D0%B4%D0%B8%D1%82%D1%8F%D1%87%D0%B0+%D0%BF%D0%BE%D1%81%D1%82%D1%96%D0%BB%D1%8C%D0%BD%D0%B0+%D0%B1%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0+%D0%B4%D0%BB%D1%8F+%D1%85%D0%BB%D0%BE%D0%BF%D1%87%D0%B8%D0%BA%D1%96%D0%B2',
        photo: Bilyzna,
        isExpensive: true,

    },
    {
        name: 'Швабра з віджимом',
        description: 'Такий собі варік, якшо чесно)) Краще робот-пилосос, або сама йому помий ті поли, бо толку з тої швабри не буде',
        photo: Shvabra,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D1%88%D0%B2%D0%B0%D0%B1%D1%80%D1%83+%D0%B7+%D0%B2%D1%96%D0%B4%D0%B6%D0%B8%D0%BC%D0%BE%D0%BC'
    },
    {
        name: 'Повербанк',
        description: 'Лічно мені просто жалко тратити на то гроші)',
        photo: Power,
        isExpensive: true,
        link: 'https://www.google.com/search?q=%D0%BA%D1%83%D0%BF%D0%B8%D1%82%D0%B8+%D0%BF%D0%BE%D0%B2%D0%B5%D1%80%D0%B1%D0%B0%D0%BD%D0%BA'
    },
]